C*********************************************************************
C*********************************************************************
C*                                                                   *
C*    格子 Boltzmann 法による衝撃波管内の１次元圧縮性流れ            *
C*             ２次元熱流体格子 BGK モデル                           *
C*       （２種類の正方形副格子と20種類の運動粒子および              *
C*　　　　　　　　　　　　　　静止粒子からなるモデル）      　　　　 *
C*                                                                   *
C*                                   Thu. 10/10/1996                 *
C*                                   programmed by    Naoki TAKADA   *
C*                                  (Graduate School of Kobe Univ.)  *
C*                                                                   *
C*********************************************************************
C*********************************************************************
C
C*********************************************************************
C*                                                                   *
C*     副格子１における粒子の種類                                                              *
C*                                                                   *
C*                                                                   *
C*                                        F13(I,J,2)                 *
C*                                             |                     *
C*                                             |                     *
C*                                   F12(I,J,2)|                     *
C*        F11(I,J,2)                           |                     *
C*             |                               |                     *
C* F11(I,J,3)  |  F11(I,J,1)       F12(I,J,3)  |  F12(I,J,1)         *
C*        -----+-----         <-----<----------+---------->----->    *
C*      F0(I,J)|           F13(I,J,3)          |          F13(I,J,1) *
C*             |                               |                     *
C*        F11(I,J,4)                           |                     *
C*                                   F12(I,J,4)|                     *
C*                                             |                     *
C*                                             |                     *
C*                                        F13(I,J,4)                 *
C*                                                                   *
C*******************[ Sublattice Type.1 ]*****************************
C*                                                        *
C*   副格子２における粒子の種類                           *
C*                                                        *
C*                                                        *
C*                             F22(I,J,2)    F22(I,J,1)   *
C*                                 .               .      *
C*  F21(I,J,2)   F21(I,J,1)          .           .        *
C*         .       .                   .       .          *
C*           .   .                       .   .            *
C*             .                           .              *
C*           .   .                       .   .            *
C*         .       .                   .       .          *
C*  F21(I,J,2)   F21(I,J,1)          .           .        *
C*                                 .               .      *
C*                             F22(I,J,3)    F22(I,J,4)   *
C*                                                        *
C************[ Sublattice Type.2 (Diagonal Cross) ]********
C
       INCLUDE 'lbshock.inc'
C
       CALL INPUT
C
       CALL INIT
C
       DO 50 II=1,TEN
C
         WRITE(*,*) 'TIME STEP = ',II
C
         CALL COLLI
C
C         CALL COLLI2
C
         CALL MOVE1(F11,DM11,M,N)
         CALL P_BC1(F11,DM11,M,N)
C         CALL S_BC1(F11,M,N)
C
         DO 10 K=1,2
           CALL MOVE1(F12,DM12,M,N)
           CALL P_BC1(F12,DM12,M,N)
C           CALL S_BC1(F12,M,N)
   10    CONTINUE
C
         DO 20 K=1,3
           CALL MOVE1(F13,DM13,M,N)
           CALL P_BC1(F13,DM13,M,N)
C           CALL S_BC1(F13,M,N)
   20    CONTINUE
C
         CALL MOVE2(F21,DM21,M,N)
         CALL P_BC2(F21,DM21,M,N)
C         CALL S_BC2(F21,M,N)
C
         DO 30 K=1,2
           CALL MOVE2(F22,DM22,M,N)
           CALL P_BC2(F22,DM22,M,N)
C           CALL S_BC2(F22,M,N)
   30    CONTINUE
C
         IF((II.GE.TIN).AND.(MOD(II,TIN).EQ.0)) THEN
C
C-----------------------------
           CALL AVERAGE
C-----------------------------
C
         ENDIF
C
   50  CONTINUE
C
       STOP
       END
C
C
C
C*********************************************************************
C*     流れ場のパラメータ入力　　　                                  *
C*********************************************************************
       SUBROUTINE INPUT
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
C
       OPEN(8,FILE='lbshock.dat',STATUS='OLD')
       READ(8,*) ROU0,DROU
       READ(8,*) E0,DE
       READ(8,*) M,N,M1
       READ(8,*) TEN,TIN
       READ(8,*) TAU,C
       READ(8,*) XMS,GANMA,PR,XMYU
       CLOSE(8)
C
       RETURN
       END
C
C
C*********************************************************************
C* 　　局所平衡分布関数の係数の計算 　　　　　                       *
C*********************************************************************
       SUBROUTINE CALCF(C,CF,E)
C---------------------------------------------------------------------
       REAL C,CF(2,0:3),E
C
       CF(1,0)=1.0E0-5.0E0*E*( 17.0E0*E*E/(8.0E0*C*C*C*C)
     &                        -35.0E0*E  /(8.0E0*C*C)
     &                        +49.0E0    / 15.0E0      )/(6.0E0*C*C)
       CF(1,1)=0.25E0*E*( 13.0E0*E*E/(4.0E0*C*C*C*C)
     &                   -71.0E0*E  /(12.0E0*C*C)
     &                   +3.0E0  )/(C*C)
       CF(1,2)=0.125E0*E*(-1.25E0*E*E/(C*C*C*C)
     &                    +25.0E0*E/(12.0E0*C*C)
     &                    -0.6E0  )/(C*C)
       CF(1,3)=E*( 0.25E0*E*E/(C*C*C*C)
     &            -0.25E0*E  /(C*C)
     &            +1.0E0/15.0E0  )/(12.0E0*C*C)
       CF(2,1)=E*E*(-0.25E0*E/(C*C)+1.0E0/3.0E0)/(C*C*C*C)
       CF(2,2)=E*E*(E/(C*C)-1.0E0/3.0E0)/(64.0E0*C*C*C*C)
C
       RETURN
       END
C
C
C*********************************************************************
C*     密度、速度、内部エネルギーの計算　　　　　　　　　　          *
C*********************************************************************
       SUBROUTINE CALE(I,J,ROU,UO,VO,E)
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
       ROU=F0(I,J)
     &    +F11(I,J,1)+F11(I,J,2)+F11(I,J,3)+F11(I,J,4)
     &    +F12(I,J,1)+F12(I,J,2)+F12(I,J,3)+F12(I,J,4)
     &    +F13(I,J,1)+F13(I,J,2)+F13(I,J,3)+F13(I,J,4)
     &    +F21(I,J,1)+F21(I,J,2)+F21(I,J,3)+F21(I,J,4)
     &    +F22(I,J,1)+F22(I,J,2)+F22(I,J,3)+F22(I,J,4)
C
       ALLE=0.5E0*(       F11(I,J,1)+F11(I,J,2)+F11(I,J,3)+F11(I,J,4)
     &             +4.0E0*( F12(I,J,1)+F12(I,J,2)
     &                     +F12(I,J,3)+F12(I,J,4) )
     &             +9.0E0*( F13(I,J,1)+F13(I,J,2)
     &                     +F13(I,J,3)+F13(I,J,4) )
     &             +2.0E0*( F21(I,J,1)+F21(I,J,2)
     &                     +F21(I,J,3)+F21(I,J,4) )
     &             +8.0E0*( F22(I,J,1)+F22(I,J,2)
     &                     +F22(I,J,3)+F22(I,J,4) ) )*C*C
C
       UO=( F11(I,J,1)+2.0E0*F12(I,J,1)+3.0E0*F13(I,J,1)
     &     -F11(I,J,3)-2.0E0*F12(I,J,3)-3.0E0*F13(I,J,3)
     &     +( F21(I,J,1)+2.0E0*F22(I,J,1)
     &       +F21(I,J,4)+2.0E0*F22(I,J,4)
     &       -F21(I,J,2)-2.0E0*F22(I,J,2)
     &       -F21(I,J,3)-2.0E0*F22(I,J,3) ) )*C/ROU
       VO=( F11(I,J,2)+2.0E0*F12(I,J,2)+3.0E0*F13(I,J,2)
     &     -F11(I,J,4)-2.0E0*F12(I,J,4)-3.0E0*F13(I,J,4)
     &     +( F21(I,J,1)+2.0E0*F22(I,J,1)
     &       +F21(I,J,2)+2.0E0*F22(I,J,2)
     &       -F21(I,J,3)-2.0E0*F22(I,J,3)
     &       -F21(I,J,4)-2.0E0*F22(I,J,4) ) )*C/ROU
C
       E=ALLE/ROU-0.5E0*(UO*UO+VO*VO)
C
       RETURN
       END
C
C
C*********************************************************************
C*     初期値の設定　　　　　　　　　　　　　　　　　　　　　　      *
C*********************************************************************
       SUBROUTINE INIT
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
C------[ 領域１での内部エネルギー（温度） ]
       T1=E0
C------[ 領域１での音速 ]
       S1=SQRT(GANMA*T1)
C------[ 領域１の流速 ]
       U1=XMS*S1
C------[ 領域１での密度 ]
       ROU1=ROU0
C------[ 領域１での圧力 ]
       P1=ROU1*T1
C------[ 領域２での内部エネルギー（温度） ]
       T2=T1*(2.0E0*GANMA*XMS*XMS-GANMA+1.0E0)
     &   *((GANMA-1.0E0)*XMS*XMS+2.0E0)
     &   /((GANMA+1.0E0)*(GANMA+1.0E0)*XMS*XMS)
C------[ 領域２での圧力 ]
       P2=P1*(2.0E0*GANMA*XMS*XMS-GANMA+1.0E0)/(GANMA+1.0E0)
C------[ 領域２での密度 ]
       ROU2=P2/T2
C------[ 領域２の流速 ]
       U2=ROU1*U1/ROU2
C------[ 領域２での音速 ]
       S2=S1*SQRT(T2/T1)
C
       FAI=XMYU/E0/TAU/ROU1+0.5E0
C       
       RE=ROU0*(U1-U2)*REAL(M-2)/XMYU
C
       S4=SQRT(GANMA*(E0+DE))
       ALPHA=(2.0E0*GANMA*XMS*XMS-GANMA+1.0E0)/(GANMA+1.0E0)
     &      *(1.0E0-(GANMA-1.0E0)*S1/(GANMA+1.0E0)/S4*(XMS-1.0E0/XMS)
     &       )**(-2.0E0*GANMA/(GANMA-1.0E0))
       ROU4=E0*ROU0/(E0+DE)*ALPHA
C   
C
       CALL CALCF(C,CF1,E0+DE)
       CALL CALCF(C,CF2,E0)
C
       DO 80 I=0,M-1
         DO 75 J=0,N-1
C
         IF(I.LE.M1-1) THEN
           F0(I,J)=EQUIL(0.0E0,0.0E0,0.0E0,PI,0.0E0
     &                              ,CF1(1,0),ROU4,E0+DE,0,1)
           DO 60 K=1,4
             F11(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,C
     &                             ,CF1(1,1),ROU4,E0+DE,K,1)
             F12(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,2.0E0*C
     &                             ,CF1(1,2),ROU4,E0+DE,K,1)
             F13(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,3.0E0*C
     &                             ,CF1(1,3),ROU4,E0+DE,K,1)
             F21(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,SQRT(2.0E0)*C
     &                             ,CF1(2,1),ROU4,E0+DE,K,2)
             F22(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,SQRT(8.0E0)*C
     &                             ,CF1(2,2),ROU4,E0+DE,K,2)
   60      CONTINUE
         ELSE
           F0(I,J)=EQUIL(0.0E0,0.0E0,0.0E0,PI,0.0E0
     &                                    ,CF2(1,0),ROU0,E0,0,1)
           DO 70 K=1,4
             F11(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,C
     &                                         ,CF2(1,1),ROU0,E0,K,1)
             F12(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,2.0E0*C
     &                                         ,CF2(1,2),ROU0,E0,K,1)
             F13(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,3.0E0*C
     &                                         ,CF2(1,3),ROU0,E0,K,1)
             F21(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,SQRT(2.0E0)*C
     &                                         ,CF2(2,1),ROU0,E0,K,2)
             F22(I,J,K)=EQUIL(0.0E0,0.0E0,0.0E0,PI,SQRT(8.0E0)*C
     &                                         ,CF2(2,2),ROU0,E0,K,2)
   70      CONTINUE
         ENDIF
C
   75    CONTINUE
   80  CONTINUE
C
       RETURN
       END
C
C
C*********************************************************************
C*       衝突過程（単一緩和時間係数 "Fai" を用いた計算）             *
C*********************************************************************
       SUBROUTINE COLLI
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
       DO 110 I=1,M-2
C    
         DO 100 J=0,N-1
C
         CALL CALE(I,J,ROU,UO,VO,E)
         CALL CALCF(C,CF,E)
C---------------------------------------------------------------------
C  
         EF0=EQUIL(UO,VO,UO*UO+VO*VO,PI,0.0E0,CF(1,0),ROU,E,0,1)
         F0(I,J)=F0(I,J)-(F0(I,J)-EF0)/FAI
         DO 95 K=1,4
           EF11=EQUIL(UO,VO,UO*UO+VO*VO,PI,      C
     &                                    ,CF(1,1),ROU,E,K,1)
           EF12=EQUIL(UO,VO,UO*UO+VO*VO,PI,2.0E0*C
     &                                    ,CF(1,2),ROU,E,K,1)
           EF13=EQUIL(UO,VO,UO*UO+VO*VO,PI,3.0E0*C
     &                                    ,CF(1,3),ROU,E,K,1)
           EF21=EQUIL(UO,VO,UO*UO+VO*VO,PI,SQRT(2.0E0)*C
     &                                    ,CF(2,1),ROU,E,K,2)
           EF22=EQUIL(UO,VO,UO*UO+VO*VO,PI,SQRT(8.0E0)*C
     &                                    ,CF(2,2),ROU,E,K,2)
           F11(I,J,K)=F11(I,J,K)-(F11(I,J,K)-EF11)/FAI
           F12(I,J,K)=F12(I,J,K)-(F12(I,J,K)-EF12)/FAI
           F13(I,J,K)=F13(I,J,K)-(F13(I,J,K)-EF13)/FAI
           F21(I,J,K)=F21(I,J,K)-(F21(I,J,K)-EF21)/FAI
           F22(I,J,K)=F22(I,J,K)-(F22(I,J,K)-EF22)/FAI
   95    CONTINUE
C---------------------------------------------------------------------
C
  100    CONTINUE
  110  CONTINUE
C
       TOTAL=0.0E0
       DO 118 I=0,M-1
         DO 117 J=0,N-1
           TOTAL=TOTAL+F0(I,J)
           DO 116 K=1,4
             TOTAL=TOTAL+F11(I,J,K)+F12(I,J,K)+F13(I,J,K)
     &                             +F21(I,J,K)+F22(I,J,K)
  116      CONTINUE
  117    CONTINUE
  118  CONTINUE
       WRITE(*,*) 'DENSITY-F-TOTAL =',TOTAL
C
       RETURN
       END
C
C
C*********************************************************************
C*     　衝突過程（単一時間緩和 BGK モデル) 　　　　　　　　         *
C*********************************************************************
       SUBROUTINE COLLI2
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
       DO 115 I=1,M-2
         DO 110 J=1,N-2
C
           CALL CALE(I,J,ROU,UO,VO,E)
           CALL CALCF(C,CF,E)
C---------------------------------------------------------------------
           DM0=F0(I,J)
           FE0=EQUIL(UO,VO,UO*UO+VO*VO,PI,0.0E0,CF(1,0),ROU,E,0,1)
           F0(I,J)=F0(I,J)-(F0(I,J)-FE0)/FAI
           DFALL=ABS(F0(I,J)-FE0)/ROU
C
           DO 105 K=1,4
             DM(1,1,K)=F11(I,J,K)
             DM(1,2,K)=F12(I,J,K)
             DM(1,3,K)=F13(I,J,K)
             DM(2,1,K)=F21(I,J,K)
             DM(2,2,K)=F22(I,J,K)
             FE(1,1,K)=EQUIL(UO,VO,UO*UO+VO*VO,PI,      C
     &                                         ,CF(1,1),ROU,E,K,1)
             FE(1,2,K)=EQUIL(UO,VO,UO*UO+VO*VO,PI,2.0E0*C
     &                                         ,CF(1,2),ROU,E,K,1)
             FE(1,3,K)=EQUIL(UO,VO,UO*UO+VO*VO,PI,3.0E0*C
     &                                         ,CF(1,3),ROU,E,K,1)
             FE(2,1,K)=EQUIL(UO,VO,UO*UO+VO*VO,PI,SQRT(2.0E0)*C
     &                                         ,CF(2,1),ROU,E,K,2)
             FE(2,2,K)=EQUIL(UO,VO,UO*UO+VO*VO,PI,2.0E0*SQRT(2.0E0)*C
     &                                         ,CF(2,2),ROU,E,K,2)
             F11(I,J,K)=F11(I,J,K)-(F11(I,J,K)-FE(1,1,K))/FAI
             F12(I,J,K)=F12(I,J,K)-(F12(I,J,K)-FE(1,2,K))/FAI
             F13(I,J,K)=F13(I,J,K)-(F13(I,J,K)-FE(1,3,K))/FAI
             F21(I,J,K)=F21(I,J,K)-(F21(I,J,K)-FE(2,1,K))/FAI
             F22(I,J,K)=F22(I,J,K)-(F22(I,J,K)-FE(2,2,K))/FAI
             DFALL=DFALL+( ABS(F11(I,J,K)-FE(1,1,K))
     &                    +ABS(F12(I,J,K)-FE(1,2,K))
     &                    +ABS(F13(I,J,K)-FE(1,3,K))
     &                    +ABS(F21(I,J,K)-FE(2,1,K))
     &                    +ABS(F22(I,J,K)-FE(2,2,K)) )/ROU
  105      CONTINUE
           IF(DFALL.GE.VNEQ) THEN
             F0(I,J)=DM0-(DM0-FE0)/(FAI+DFAI)
             DO 108 K=1,4
               F11(I,J,K)=DM(1,1,K)-(DM(1,1,K)-FE(1,1,K))/(FAI+DFAI)
               F12(I,J,K)=DM(1,2,K)-(DM(1,2,K)-FE(1,2,K))/(FAI+DFAI)
               F13(I,J,K)=DM(1,3,K)-(DM(1,3,K)-FE(1,3,K))/(FAI+DFAI)
               F21(I,J,K)=DM(2,1,K)-(DM(2,1,K)-FE(2,1,K))/(FAI+DFAI)
               F22(I,J,K)=DM(2,2,K)-(DM(2,2,K)-FE(2,2,K))/(FAI+DFAI)
  108        CONTINUE
           ENDIF
C---------------------------------------------------------------------
C
  110    CONTINUE
  115  CONTINUE
C
       RETURN
       END
C
C
C*********************************************************************
C*    　 副格子１での粒子の並進　　　　　　　　　                    *
C*********************************************************************
       SUBROUTINE MOVE1(F,DMF,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4),DMF(0:8000,0:10,4)
C
       DO 140 I=0,M-1
         DO 130 J=0,N-1
           DO 120 K=1,4
             DMF(I,J,K)=F(I,J,K)
  120      CONTINUE
  130    CONTINUE
  140  CONTINUE
C
C------------------------------------------------[ 1-DIRECTION ]
C    
       DO 210 J=0,N-1
         DO 200 I=M-1,1,-1
           F(I,J,1)=F(I-1,J,1)
  200    CONTINUE
  210  CONTINUE
C------------------------------------------------[ 2-DIRECTION ]
       DO 230 J=N-1,1,-1
         DO 220 I=1,M-2
           F(I,J,2)=F(I,J-1,2)
  220    CONTINUE
  230  CONTINUE
C------------------------------------------------[ 3-DIRECTION ]
C   
       DO 260 J=N-1,0,-1
         DO 250 I=0,M-2
           F(I,J,3)=F(I+1,J,3)
  250    CONTINUE
  260  CONTINUE
C------------------------------------------------[ 4-DIRECTION ]
       DO 290 J=0,N-2
         DO 280 I=1,M-2
           F(I,J,4)=F(I,J+1,4)
  280    CONTINUE
  290  CONTINUE
C---------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*     　副格子２での粒子の並進　　　　　　　　　                    *
C*********************************************************************
       SUBROUTINE MOVE2(F,DMF,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4),DMF(0:8000,0:10,4)
C
       DO 310 I=0,M-1
         DO 305 J=0,N-1
           DO 300 K=1,4
             DMF(I,J,K)=F(I,J,K)
  300      CONTINUE
  305    CONTINUE
  310  CONTINUE
C
C------------------------------------------------[ 1-DIRECTION ]
       DO 320 J=N-1,1,-1
         DO 315 I=1,M-1
           F(I,J,1)=F(I-1,J-1,1)
  315    CONTINUE
  320  CONTINUE
C------------------------------------------------[ 2-DIRECTION ]
       DO 330 J=N-1,1,-1
         DO 325 I=0,M-2
           F(I,J,2)=F(I+1,J-1,2)
  325    CONTINUE
  330  CONTINUE
C------------------------------------------------[ 3-DIRECTION ]
       DO 350 J=0,N-2
         DO 340 I=0,M-2
           F(I,J,3)=F(I+1,J+1,3)
  340    CONTINUE
  350  CONTINUE
C------------------------------------------------[ 4-DIRECTION ]
       DO 370 J=0,N-2
         DO 360 I=1,M-1
           F(I,J,4)=F(I-1,J+1,4)
  360    CONTINUE
  370  CONTINUE
C---------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*     　副格子１での滑り壁の境界条件　　　　　　　　　　　　        *
C*********************************************************************
       SUBROUTINE S_BC1(F,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4)
C
C------------------------------------------[ 上面 & 下面の境界 ]
       DO 460 I=1,M-2
         F(I,N-1,4)=F(I,N-1,2)
         F(I,0,2)=F(I,0,4)
  460  CONTINUE
C--------------------------------------------[ 左 & 右の境界 ]
       DO 470 J=1,N-2
         F(0,J,1)=F(0,J,3)
         F(M-1,J,3)=F(M-1,J,1)
  470  CONTINUE
C---------------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*     　副格子２での滑り壁の境界条件　　　　　　　　　　　　        *
C*********************************************************************
       SUBROUTINE S_BC2(F,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4)
C
C------------------------------------------[ 上面 & 下面の境界 ]
       DO 510 I=1,M-2
         F(I,N-1,3)=F(I,N-1,2)
         F(I,N-1,4)=F(I,N-1,1)
         F(I,0,1)=F(I,0,4)
         F(I,0,2)=F(I,0,3)
  510  CONTINUE
C------------------------------------------[ 左 & 右の境界 ]
       DO 520 J=1,N-2
         F(0,J,1)=F(0,J,2)
         F(0,J,4)=F(0,J,3)
         F(M-1,J,2)=F(M-1,J,1)
         F(M-1,J,3)=F(M-1,J,4)
  520  CONTINUE
C----------------------------------------------[ 4つのかどでの境界 ]
       F(0,N-1,4)=F(0,N-1,2)
       F(M-1,N-1,3)=F(M-1,N-1,1)
       F(0,0,1)=F(0,0,3)
       F(M-1,0,2)=F(M-1,0,4)
C---------------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*     　副格子１での滑り壁の境界条件　　　　　　　　　　　　        *
C*********************************************************************
       SUBROUTINE P_BC1(F,DMF,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4),DMF(0:8000,0:10,4)
C
C------------------------------------------[ 上面 & 下面の境界 ]
       DO 460 I=1,M-2
         F(I,N-1,4)=DMF(I,0,4)
         F(I,0,2)=DMF(I,N-1,2)
  460  CONTINUE
C--------------------------------------------[ 左 & 右の境界 ]
       DO 470 J=0,N-1
         F(0,J,1)=F(0,J,3)
         F(M-1,J,3)=F(M-1,J,1)
  470  CONTINUE
C---------------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*    　 副格子２での滑り壁の境界条件２　　　　　　　　　　　        *
C*********************************************************************
       SUBROUTINE P_BC2(F,DMF,M,N)
C---------------------------------------------------------------------
       REAL F(0:8000,0:10,4),DMF(0:8000,0:10,4)
C
C------------------------------------------[ 上面 & 下面の境界 ]
       DO 510 I=1,M-2
         F(I,N-1,3)=DMF(I+1,0,3)
         F(I,N-1,4)=DMF(I-1,0,4)
         F(I,0,1)=DMF(I-1,N-1,1)
         F(I,0,2)=DMF(I+1,N-1,2)
  510  CONTINUE
C--------------------------------------------[ 左 & 右の境界 ]
       DO 520 J=1,N-2
         F(0,J,1)=F(0,J,2)
         F(0,J,4)=F(0,J,3)
         F(M-1,J,2)=F(M-1,J,1)
         F(M-1,J,3)=F(M-1,J,4)
  520  CONTINUE
C----------------------------------------------[ 4つのかどでの境界 ]
       F(0,N-1,4)=DMF(1,0,3)
       F(0,N-1,1)=F(0,N-1,2)
       F(M-1,N-1,3)=DMF(M-2,0,4)
       F(M-1,N-1,2)=F(M-1,N-1,1)
       F(0,0,1)=DMF(1,N-1,2)
       F(0,0,4)=F(0,0,3)
       F(M-1,0,2)=DMF(M-2,N-1,1)
       F(M-1,0,3)=F(M-1,0,4)
C---------------------------------------------------------------------
C
       RETURN
       END
C
C
C*********************************************************************
C*     　流れ場での平均データの出力　　　　　                        *
C*********************************************************************
       SUBROUTINE AVERAGE
C---------------------------------------------------------------------
       INCLUDE 'lbshock.inc'
C
C
       TIME=FLOAT(II)+0.001
       KK=INT(TIME)
       K12=KK/10000000
       K11=KK-K12*10000000
       K10=K11/1000000
       KK9=K11-K10*1000000
       KK8=KK9/100000
       KK7=KK9-KK8*100000
       KK6=KK7/10000
       KK5=KK7-KK6*10000
       KK4=KK5/1000
       KK3=KK5-KK4*1000
       KK2=KK3/100
       KK1=KK3-KK2*100
       KK0=KK1/10
       KKK=KK1-KK0*10
       NAME='ssq3a'//CHAR(KK4+48)//CHAR(KK2+48)//CHAR(KK0+48)//'.ss5'
C
       OPEN(9,FILE=NAME,STATUS='UNKNOWN')
       WRITE(9,*) ROU0,DROU
       WRITE(9,*) E0,DE
       WRITE(9,*) M,N,M1
       WRITE(9,*) TEN,TIN,II
       WRITE(9,*) TAU,C
       WRITE(9,*) U1,ROU1,T1,P1,S1
       WRITE(9,*) U2,ROU2,T2,P2,S2
       WRITE(9,*) XMS,GANMA,PR,XMYU
C
       DO 470 I=0,M-1
C
         AVU(I)=0.0E0
         AVP   =0.0E0
         AVE   =0.0E0
         AVR   =0.0E0
C
         DO 460 J=1,N-2
C
           ROU=F0(I,J)
     &        +F11(I,J,1)+F11(I,J,2)+F11(I,J,3)+F11(I,J,4)
     &        +F12(I,J,1)+F12(I,J,2)+F12(I,J,3)+F12(I,J,4)
     &        +F13(I,J,1)+F13(I,J,2)+F13(I,J,3)+F13(I,J,4)
     &        +F21(I,J,1)+F21(I,J,2)+F21(I,J,3)+F21(I,J,4)
     &        +F22(I,J,1)+F22(I,J,2)+F22(I,J,3)+F22(I,J,4)
C
           ALLE=0.5E0*(F11(I,J,1)+F11(I,J,2)+F11(I,J,3)+F11(I,J,4)
     &                 +4.0E0*( F12(I,J,1)+F12(I,J,2)
     &                         +F12(I,J,3)+F12(I,J,4) )
     &                 +9.0E0*( F13(I,J,1)+F13(I,J,2)
     &                         +F13(I,J,3)+F13(I,J,4) )
     &                 +2.0E0*( F21(I,J,1)+F21(I,J,2)
     &                         +F21(I,J,3)+F21(I,J,4) )
     &                 +8.0E0*( F22(I,J,1)+F22(I,J,2)
     &                         +F22(I,J,3)+F22(I,J,4) ) )*C*C
C
           U=( F11(I,J,1)+2.0E0*F12(I,J,1)+3.0E0*F13(I,J,1)
     &        -F11(I,J,3)-2.0E0*F12(I,J,3)-3.0E0*F13(I,J,3)
     &        +( F21(I,J,1)+2.0E0*F22(I,J,1)
     &          +F21(I,J,4)+2.0E0*F22(I,J,4)
     &          -F21(I,J,2)-2.0E0*F22(I,J,2)
     &          -F21(I,J,3)-2.0E0*F22(I,J,3) ) )*C/ROU
C
           V=( F11(I,J,2)+2.0E0*F12(I,J,2)+3.0E0*F13(I,J,2)
     &        -F11(I,J,4)-2.0E0*F12(I,J,4)-3.0E0*F13(I,J,4)
     &        +( F21(I,J,1)+2.0E0*F22(I,J,1)
     &          +F21(I,J,2)+2.0E0*F22(I,J,2)
     &          -F21(I,J,3)-2.0E0*F22(I,J,3)
     &          -F21(I,J,4)-2.0E0*F22(I,J,4) ) )*C/ROU
C
           ENE=ALLE/ROU-0.5E0*(U*U+V*V)
C
           P=ROU*ENE
C
           AVU(I)=AVU(I)+  U/REAL(N-2)
           AVP   =AVP   +  P/REAL(N-2)
           AVE   =AVE   +ENE/REAL(N-2)
           AVR   =AVR   +ROU/REAL(N-2)
C
  460    CONTINUE
c       
  470  CONTINUE
C
       DO 430 I=1,M-2
         IF((AVU(I).GT.AVU(I+1)).AND.
     &      ((AVU(I).GE.0.5E0*(U1-U2)).AND.
     &      (AVU(I+1).LE.0.5E0*(U1-U2)))) THEN
           X0=I*C*TAU+(AVU(I)-0.5E0*(U1-U2))/(AVU(I)-AVU(I+1))
     &              *C*TAU
           WRITE(9,*) X0
         ENDIF
  430  CONTINUE
C
       CLOSE(9)
C
       RETURN
       END
C
C
C*********************************************************************
C*     　局所平衡分布関数　　　　　　　　　　　                      *
C*********************************************************************
C---------------------------------------------------------------------
       REAL FUNCTION EQUIL(U,V,U2,PI,C,CF,ROU,E,K,L)
C---------------------------------------------------------------------
       REAL U,V,U2,PI,C,CF,E,ROU,THETA,CONST
C
       IF(L.EQ.1) THEN
         THETA=PI*(K-1)/2.0E0
       ELSE
         THETA=PI*((K-1)/2.0E0+0.25E0)
       ENDIF
       CONST=C*(COS(THETA)*U+SIN(THETA)*V)/E
       EQUIL=CF*ROU*( 1.0E0
     &               +      CONST
     &               +0.5E0*CONST*CONST
     &               -0.5E0*U2/E
     &               -0.5E0*CONST*U2/E
     &               +      CONST*CONST*CONST/6.0E0 )
C
       RETURN
       END
